# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

spisok=[2,6,5,7,8,10]
spisok1=[]
for i in range(int(len(spisok)/2)):
    if spisok[i]!=spisok[-1-i]:
        spisok1.append(spisok[i]*spisok[-1-i])
print(spisok,'=>',spisok1)

       
    

